In [1]:
# importing library

import pandas as pd

In [2]:
# loading dataset

data = pd.read_csv('C:\\Users\\Admin\\Internshala\\Frequency_Table_dataset.csv')

In [4]:
# printing all data 

data

    Student  Overall Marks  Gender    Subject
0     Anish           9700    Male    English
1   Rishabh             83    Male    English
2      Ajay             78    Male    Physics
3   Abhinav             86    Male  Chemistry
4    Anurag             91    Male    English
..      ...            ...     ...        ...
95  Aaditya             77    Male  Chemistry
96    vivek             55    Male    Physics
97    Tisha              7  Female    English
98   Raghav             73    Male    English
99   Ishita             82  Female  Chemistry

[100 rows x 4 columns]

In [5]:
# printing top 5 rows

data.head()

   Student  Overall Marks Gender    Subject
0    Anish           9700   Male    English
1  Rishabh             83   Male    English
2     Ajay             78   Male    Physics
3  Abhinav             86   Male  Chemistry
4   Anurag             91   Male    English

# Frequency table for categorical variable

In [6]:
# Generating frequency table

freq_data = data['Subject'].value_counts()

In [7]:
print(freq_data)

Chemistry    36
Physics      35
English      29
Name: Subject, dtype: int64